songky08/AurduinoOS/h/intids_tc27x.h
#define SRC_ID_DMAERR			316	/* DMA Error Service Request */

#define SRC_ID_DMACH0			320	/* DMA Channel  0 Service Request */
#define SRC_ID_DMACH1			321	/* DMA Channel  1 Service Request */
#define SRC_ID_DMACH2			322	/* DMA Channel  2 Service Request */
#define SRC_ID_DMACH3			323	/* DMA Channel  3 Service Request */
#define SRC_ID_DMACH4			324	/* DMA Channel  4 Service Request */
#define SRC_ID_DMACH5			325	/* DMA Channel  5 Service Request */
#define SRC_ID_DMACH6			326	/* DMA Channel  6 Service Request */
#define SRC_ID_DMACH7			327	/* DMA Channel  7 Service Request */
#define SRC_ID_DMACH8			328	/* DMA Channel  8 Service Request */
#define SRC_ID_DMACH9			329	/* DMA Channel  9 Service Request */
#define SRC_ID_DMACH10			330	/* DMA Channel 10 Service Request */
#define SRC_ID_DMACH11			331	/* DMA Channel 11 Service Request */
#define SRC_ID_DMACH12			332	/* DMA Channel 12 Service Request */
#define SRC_ID_DMACH13			333	/* DMA Channel 13 Service Request */
#define SRC_ID_DMACH14			334	/* DMA Channel 14 Service Request */
#define SRC_ID_DMACH15			335	/* DMA Channel 15 Service Request */
#define SRC_ID_DMACH16			336	/* DMA Channel 16 Service Request */
#define SRC_ID_DMACH17			337	/* DMA Channel 17 Service Request */
#define SRC_ID_DMACH18			338	/* DMA Channel 18 Service Request */
#define SRC_ID_DMACH19			339	/* DMA Channel 19 Service Request */
#define SRC_ID_DMACH20			340	/* DMA Channel 20 Service Request */
#define SRC_ID_DMACH21			341	/* DMA Channel 21 Service Request */
#define SRC_ID_DMACH22			342	/* DMA Channel 22 Service Request */
#define SRC_ID_DMACH23			343	/* DMA Channel 23 Service Request */
#define SRC_ID_DMACH24			344	/* DMA Channel 24 Service Request */
#define SRC_ID_DMACH25			345	/* DMA Channel 25 Service Request */
#define SRC_ID_DMACH26			346	/* DMA Channel 26 Service Request */
#define SRC_ID_DMACH27			347	/* DMA Channel 27 Service Request */
#define SRC_ID_DMACH28			348	/* DMA Channel 28 Service Request */
#define SRC_ID_DMACH29			349	/* DMA Channel 29 Service Request */
#define SRC_ID_DMACH30			350	/* DMA Channel 30 Service Request */
#define SRC_ID_DMACH31			351	/* DMA Channel 31 Service Request */
#define SRC_ID_DMACH32			352	/* DMA Channel 32 Service Request */
#define SRC_ID_DMACH33			353	/* DMA Channel 33 Service Request */
#define SRC_ID_DMACH34			354	/* DMA Channel 34 Service Request */
#define SRC_ID_DMACH35			355	/* DMA Channel 35 Service Request */
#define SRC_ID_DMACH36			356	/* DMA Channel 36 Service Request */
#define SRC_ID_DMACH37			357	/* DMA Channel 37 Service Request */
#define SRC_ID_DMACH38			358	/* DMA Channel 38 Service Request */
#define SRC_ID_DMACH39			359	/* DMA Channel 39 Service Request */
#define SRC_ID_DMACH40			360	/* DMA Channel 40 Service Request */
#define SRC_ID_DMACH41			361	/* DMA Channel 41 Service Request */
#define SRC_ID_DMACH42			362	/* DMA Channel 42 Service Request */
#define SRC_ID_DMACH43			363	/* DMA Channel 43 Service Request */
#define SRC_ID_DMACH44			364	/* DMA Channel 44 Service Request */
#define SRC_ID_DMACH45			365	/* DMA Channel 45 Service Request */
#define SRC_ID_DMACH46			366	/* DMA Channel 46 Service Request */
#define SRC_ID_DMACH47			367	/* DMA Channel 47 Service Request */
#define SRC_ID_DMACH48			368	/* DMA Channel 48 Service Request */
#define SRC_ID_DMACH49			369	/* DMA Channel 49 Service Request */
#define SRC_ID_DMACH50			370	/* DMA Channel 50 Service Request */
#define SRC_ID_DMACH51			371	/* DMA Channel 51 Service Request */
#define SRC_ID_DMACH52			372	/* DMA Channel 52 Service Request */
#define SRC_ID_DMACH53			373	/* DMA Channel 53 Service Request */
#define SRC_ID_DMACH54			374	/* DMA Channel 54 Service Request */
#define SRC_ID_DMACH55			375	/* DMA Channel 55 Service Request */
#define SRC_ID_DMACH56			376	/* DMA Channel 56 Service Request */
#define SRC_ID_DMACH57			377	/* DMA Channel 57 Service Request */
#define SRC_ID_DMACH58			378	/* DMA Channel 58 Service Request */
#define SRC_ID_DMACH59			379	/* DMA Channel 59 Service Request */
#define SRC_ID_DMACH60			380	/* DMA Channel 60 Service Request */
#define SRC_ID_DMACH61			381	/* DMA Channel 61 Service Request */
#define SRC_ID_DMACH62			382	/* DMA Channel 62 Service Request */
#define SRC_ID_DMACH63			383	/* DMA Channel 63 Service Request */

#define SRC_ID_ETH				572	/* Ethernet Service Request */

#define SRC_ID_CANINT0			576	/* MultiCAN+ Service Request 0 */
#define SRC_ID_CANINT1			577	/* MultiCAN+ Service Request 1 */
#define SRC_ID_CANINT2			578	/* MultiCAN+ Service Request 2 */
#define SRC_ID_CANINT3			579	/* MultiCAN+ Service Request 3 */
#define SRC_ID_CANINT4			580	/* MultiCAN+ Service Request 4 */
#define SRC_ID_CANINT5			581	/* MultiCAN+ Service Request 5 */
#define SRC_ID_CANINT6			582	/* MultiCAN+ Service Request 6 */
#define SRC_ID_CANINT7			583	/* MultiCAN+ Service Request 7 */
#define SRC_ID_CANINT8			584	/* MultiCAN+ Service Request 8 */
#define SRC_ID_CANINT9			585	/* MultiCAN+ Service Request 9 */
#define SRC_ID_CANINT10			586	/* MultiCAN+ Service Request 10 */
#define SRC_ID_CANINT11			587	/* MultiCAN+ Service Request 11 */
#define SRC_ID_CANINT12			588	/* MultiCAN+ Service Request 12 */
#define SRC_ID_CANINT13			589	/* MultiCAN+ Service Request 13 */
#define SRC_ID_CANINT14			590	/* MultiCAN+ Service Request 14 */
#define SRC_ID_CANINT15			591	/* MultiCAN+ Service Request 15 */

#define SRC_ID_VADCG0SR0		608	/* VADC Group 0 Service Request 0 */
#define SRC_ID_VADCG0SR1		609	/* VADC Group 0 Service Request 1 */
#define SRC_ID_VADCG0SR2		610	/* VADC Group 0 Service Request 2 */
#define SRC_ID_VADCG0SR3		611	/* VADC Group 0 Service Request 3 */
#define SRC_ID_VADCG1SR0		612	/* VADC Group 1 Service Request 0 */
#define SRC_ID_VADCG1SR1		613	/* VADC Group 1 Service Request 1 */
#define SRC_ID_VADCG1SR2		614	/* VADC Group 1 Service Request 2 */
#define SRC_ID_VADCG1SR3		615	/* VADC Group 1 Service Request 3 */
#define SRC_ID_VADCG2SR0		616	/* VADC Group 2 Service Request 0 */
#define SRC_ID_VADCG2SR1		617	/* VADC Group 2 Service Request 1 */
#define SRC_ID_VADCG2SR2		618	/* VADC Group 2 Service Request 2 */
#define SRC_ID_VADCG2SR3		619	/* VADC Group 2 Service Request 3 */
#define SRC_ID_VADCG3SR0		620	/* VADC Group 3 Service Request 0 */
#define SRC_ID_VADCG3SR1		621	/* VADC Group 3 Service Request 1 */
#define SRC_ID_VADCG3SR2		622	/* VADC Group 3 Service Request 2 */
#define SRC_ID_VADCG3SR3		623	/* VADC Group 3 Service Request 3 */
#define SRC_ID_VADCG4SR0		624	/* VADC Group 4 Service Request 0 */
#define SRC_ID_VADCG4SR1		625	/* VADC Group 4 Service Request 1 */
#define SRC_ID_VADCG4SR2		626	/* VADC Group 4 Service Request 2 */
#define SRC_ID_VADCG4SR3		627	/* VADC Group 4 Service Request 3 */
#define SRC_ID_VADCG5SR0		628	/* VADC Group 5 Service Request 0 */
#define SRC_ID_VADCG5SR1		629	/* VADC Group 5 Service Request 1 */
#define SRC_ID_VADCG5SR2		630	/* VADC Group 5 Service Request 2 */
#define SRC_ID_VADCG5SR3		631	/* VADC Group 5 Service Request 3 */
#define SRC_ID_VADCG6SR0		632	/* VADC Group 6 Service Request 0 */
#define SRC_ID_VADCG6SR1		633	/* VADC Group 6 Service Request 1 */
#define SRC_ID_VADCG6SR2		634	/* VADC Group 6 Service Request 2 */
#define SRC_ID_VADCG6SR3		635	/* VADC Group 6 Service Request 3 */
#define SRC_ID_VADCG7SR0		636	/* VADC Group 7 Service Request 0 */
#define SRC_ID_VADCG7SR1		637	/* VADC Group 7 Service Request 1 */
#define SRC_ID_VADCG7SR2		638	/* VADC Group 7 Service Request 2 */
#define SRC_ID_VADCG7SR3		639	/* VADC Group 7 Service Request 3 */

#define SRC_ID_VADCCG0SR0		680	/* VADC Common Group 0 Service Request 0 */
#define SRC_ID_VADCCG0SR1		681	/* VADC Common Group 0 Service Request 1 */
#define SRC_ID_VADCCG0SR2		682	/* VADC Common Group 0 Service Request 2 */
#define SRC_ID_VADCCG0SR3		683	/* VADC Common Group 0 Service Request 3 */
#define SRC_ID_VADCCG1SR0		684	/* VADC Common Group 1 Service Request 0 */
#define SRC_ID_VADCCG1SR1		685	/* VADC Common Group 1 Service Request 1 */
#define SRC_ID_VADCCG1SR2		686	/* VADC Common Group 1 Service Request 2 */
#define SRC_ID_VADCCG1SR3		687	/* VADC Common Group 1 Service Request 3 */

#define SRC_ID_DSADCSRM0		724	/* DSADC SRM0 Service Request */
#define SRC_ID_DSADCSRA0		725	/* DSADC SRA0 Service Request */
#define SRC_ID_DSADCSRM1		726	/* DSADC SRM1 Service Request */
#define SRC_ID_DSADCSRA1		727	/* DSADC SRA1 Service Request */
#define SRC_ID_DSADCSRM2		728	/* DSADC SRM2 Service Request */
#define SRC_ID_DSADCSRA2		729	/* DSADC SRA2 Service Request */
#define SRC_ID_DSADCSRM3		730	/* DSADC SRM3 Service Request */
#define SRC_ID_DSADCSRA3		731	/* DSADC SRA3 Service Request */
#define SRC_ID_DSADCSRM4		732	/* DSADC SRM4 Service Request */
#define SRC_ID_DSADCSRA4		733	/* DSADC SRA4 Service Request */
#define SRC_ID_DSADCSRM5		734	/* DSADC SRM5 Service Request */
#define SRC_ID_DSADCSRA5		735	/* DSADC SRA5 Service Request */

#define SRC_ID_ERAYINT0			760	/* E-RAY Service Request 0 */
#define SRC_ID_ERAYINT1			761	/* E-RAY Service Request 1 */
#define SRC_ID_ERAYTINT0		762	/* E-RAY Timer Interrupt 0 Service Request */
#define SRC_ID_ERAYTINT1		763	/* E-RAY Timer Interrupt 1 Service Request */
#define SRC_ID_ERAYNDAT0		764	/* E-RAY New Data 0 Service Request */
#define SRC_ID_ERAYNDAT1		765	/* E-RAY New Data 1 Service Request */
#define SRC_ID_ERAYMBSC0		766	/* E-RAY Message Buffer Status Changed 0 Service Request */
#define SRC_ID_ERAYMBSC1		767	/* E-RAY Message Buffer Status Changed 1 Service Request */
#define SRC_ID_ERAYOBUSY		768	/* E-RAY Output Buffer Busy Service Request */
#define SRC_ID_ERAYIBUSY		769	/* E-RAY Input Buffer Busy Service Request */

#define SRC_ID_PMU00			780	/* PMU 0 Service Request 0 */
#define SRC_ID_PMU01			781	/* PMU 0 Service Request 1 */

